In [27]:
import pandas as pd

In [28]:
dataset={'student' : ['abc','def','frt'],
        'addmission' : [2023,2022,2021]}
demo=pd.DataFrame(dataset)
print(demo)

  student  addmission
0     abc        2023
1     def        2022
2     frt        2021

In [29]:

print(pd.__version__)

1.4.2

In [30]:
a=[20,30,40,50]
demo1=pd.Series(a)
print(demo1)

0    20
1    30
2    40
3    50
dtype: int64

In [31]:
demo2=pd.Series(a,index=["M1","M2","M3","M4"])
print(demo2)

M1    20
M2    30
M3    40
M4    50
dtype: int64

In [32]:
print(demo2["M3"])

40

In [33]:
marks={"abc":440,"def":220,"ssd":300}
demo2=pd.Series(marks)
print(demo2)
print(demo2["abc"])

abc    440
def    220
ssd    300
dtype: int64
440

In [34]:
demo3=pd.Series(marks,index=["abc","ssd"])
print(demo)

  student  addmission
0     abc        2023
1     def        2022
2     frt        2021

In [35]:
pd.options.display.max_rows=10
stud=pd.read_csv('datademo.csv')
print(stud)

   id    name department  points
0   1  dhruvi         HR     200
1   2   palak         IT     300
2   3     ved     Design     100
3   4  Dhruti         HR     200
4   5  Bhavin  Marketing     300
5   6  dhruvi         HR     200
6   7   palak         IT     300

In [36]:
print(stud_Marks.tail())

   id    name department  points
2   3     ved     Design     100
3   4  Dhruti         HR     200
4   5  Bhavin  Marketing     300
5   6  dhruvi         HR     200
6   7   palak         IT     300

In [37]:
pd.options.display.max_rows=10
new_stud=pd.read_csv('datademo2.csv')
print(new_stud)

   id     name  salary
0   1    yatri   10000
1   2    bansi   20000
2   3       om   30000
3   4  devansh   40000
4   5     hiya   50000

In [38]:
mean = stud["points"].mean()
print(mean)

228.57142857142858

In [39]:
median = stud["points"].mean()
print(f"median :{median}")

median :228.57142857142858

In [40]:
mode = stud["points"].mode()
print(f"mode : {mode}")

mode : 0    200
1    300
Name: points, dtype: int64

In [41]:
stud.columns

Index(['id', 'name', 'department', 'points'], dtype='object')

In [43]:
print(stud.loc[0:2])

   id    name department  points
0   1  dhruvi         HR     200
1   2   palak         IT     300
2   3     ved     Design     100

In [44]:
stud.sort_values(["points"],ascending=0)

   id    name department  points
1   2   palak         IT     300
4   5  Bhavin  Marketing     300
6   7   palak         IT     300
0   1  dhruvi         HR     200
3   4  Dhruti         HR     200
5   6  dhruvi         HR     200
2   3     ved     Design     100

In [45]:
stud.sort_values(["points"],ascending=1)

   id    name department  points
2   3     ved     Design     100
0   1  dhruvi         HR     200
3   4  Dhruti         HR     200
5   6  dhruvi         HR     200
1   2   palak         IT     300
4   5  Bhavin  Marketing     300
6   7   palak         IT     300